# GetOrientTo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryConditions..::..GetOrientTo Method
BoundaryConditions Class See Also
---
Returns the boundary conditions orientation option.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public BoundaryConditionsOrientTo GetOrientTo()
```

Visual Basic
---
```text
Public Function GetOrientTo As BoundaryConditionsOrientTo
```

Visual C++
---
```text
public:
BoundaryConditionsOrientTo GetOrientTo()
```

# ### Return Value
The orientation option.
# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace